# Oil v. Gold Comparison

You want to compare the monthly closing price of gold v. oil over the past decade.

The easiest way to uncover a pattern will be to line graph the data

The data can be [found here](https://drive.google.com/file/d/122tdS2eTZEq9q7bbKEZMf6168Vi8biRh/view?usp=share_link).

## What is our approach?

In [1]:
import pandas as pd

In [2]:
df_raw = pd.read_csv("oil-v-gold.csv")
df_raw

    GC1 Comdty (Gold) Unnamed: 1  Unnamed: 2 CL1 Comdty (Oil) Unnamed: 4
0                Date    PX_LAST         NaN             Date    PX_LAST
1           1/31/2008      922.7         NaN        1/31/2008      91.75
2           2/29/2008        975         NaN        2/29/2008     101.84
3           3/31/2008      916.2         NaN        3/31/2008     101.58
4           4/30/2008      865.1         NaN        4/30/2008     113.46
..                ...        ...         ...              ...        ...
117         9/29/2017     1281.5         NaN        9/29/2017      51.67
118        10/31/2017     1270.5         NaN       10/31/2017      54.38
119        11/30/2017     1273.2         NaN       11/30/2017       57.4
120        12/29/2017     1309.3         NaN       12/29/2017      60.42
121         1/31/2018       1339         NaN        1/31/2018      64.73

[122 rows x 5 columns]

In [3]:
df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   GC1 Comdty (Gold)  122 non-null    object
 1   Unnamed: 1         122 non-null    object
 2   Unnamed: 2         0 non-null      float64
 3   CL1 Comdty (Oil)   122 non-null    object
 4   Unnamed: 4         122 non-null    object
dtypes: float64(1), object(4)
memory usage: 4.9+ KB

# Fix it
## drop duplicates and nan values 
## convert objects into floaing point numbers
## drop column names, provide sensical
## rename gold and oil columns

In [4]:
## drop duplicates
df_raw.columns

Index(['GC1 Comdty (Gold)', 'Unnamed: 1', 'Unnamed: 2', 'CL1 Comdty (Oil)',
       'Unnamed: 4'],
      dtype='object')

In [5]:
df = df_raw[['GC1 Comdty (Gold)', 'Unnamed: 1', 'Unnamed: 4']]
df

    GC1 Comdty (Gold) Unnamed: 1 Unnamed: 4
0                Date    PX_LAST    PX_LAST
1           1/31/2008      922.7      91.75
2           2/29/2008        975     101.84
3           3/31/2008      916.2     101.58
4           4/30/2008      865.1     113.46
..                ...        ...        ...
117         9/29/2017     1281.5      51.67
118        10/31/2017     1270.5      54.38
119        11/30/2017     1273.2       57.4
120        12/29/2017     1309.3      60.42
121         1/31/2018       1339      64.73

[122 rows x 3 columns]